# NumberSystemDisplayRule Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..NumberSystemDisplayRule Property
ParameterTypeId Class See Also
---
"Display Rule"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId NumberSystemDisplayRule { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NumberSystemDisplayRule As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ NumberSystemDisplayRule {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace